Documents/ЧекККМВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЧекККМВозврат</Name>
			<BasedOn>
				<xr:Item>Document.ЧекККМ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКассахККМ</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЭквайрингу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОрдера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПлатежаСписком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеВКассу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧековККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекККМ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАванса</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОплатаПлатежнымиКартами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>24</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылочныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧекаЭТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеВКассу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеВКассу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДенежныхСредствПоЭквайрингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредствПоЭквайрингу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеПоПлатежнойКарте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПоПлатежнойКарте</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЧекККМВозврат/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаЧекККМВозврат, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Период,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Организация,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ЛицевойСчет,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Услуга,
		|	-ВременнаяТаблицаРасшифровкаПлатежа.Сумма КАК Сумма,
		|	ВременнаяТаблицаРасшифровкаПлатежа.МесяцНачисления,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
		|ГДЕ
		|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеВКассу.ОтЛицевогоСчета)";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЛицевымСчетам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуДенежныеСредстваВКассахККМ(ДокументСсылкаЧекККМВозврат, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДенежныеСредстваВКассеККМ.Период КАК Период,
		|	ДенежныеСредстваВКассеККМ.Организация КАК Организация,
		|	ДенежныеСредстваВКассеККМ.КассаККМ КАК КассаККМ,
		|	СУММА(ДенежныеСредстваВКассеККМ.Сумма) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблицаШапка.Период КАК Период,
		|		ВременнаяТаблицаШапка.Организация КАК Организация,
		|		ВременнаяТаблицаШапка.КассаККМ КАК КассаККМ,
		|		-ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма
		|	ИЗ
		|		ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаОплатаПлатежнымиКартами.Период,
		|		ВременнаяТаблицаОплатаПлатежнымиКартами.Организация,
		|		ВременнаяТаблицаОплатаПлатежнымиКартами.КассаККМ,
		|		ВременнаяТаблицаОплатаПлатежнымиКартами.Сумма
		|	ИЗ
		|		ВременнаяТаблицаОплатаПлатежнымиКартами КАК ВременнаяТаблицаОплатаПлатежнымиКартами) КАК ДенежныеСредстваВКассеККМ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредстваВКассеККМ.Период,
		|	ДенежныеСредстваВКассеККМ.Организация,
		|	ДенежныеСредстваВКассеККМ.КассаККМ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваВКассахККМ", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуДенежныеСредстваВКассахККМ()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетыПоЭквайрингу(ДокументСсылкаЧекККМВозврат, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.Период,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.Организация,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.ВидПлатежнойКарты,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.НомерПлатежнойКарты,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.Сумма,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.Валюта,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.ДатаПлатежа,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.ТипДенежныхСредств,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.ЛицевойСчет
		|ИЗ
		|	ВременнаяТаблицаОплатаПлатежнымиКартами КАК ВременнаяТаблицаОплатаПлатежнымиКартами";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЭквайрингу", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЭквайрингу()

Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЧекККМВозврат, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка.Дата КАК Период,
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка.Организация,
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка.ЛицевойСчет,
		|	ПоступлениеВКассуРасшифровкаПлатежа.Услуга,
		|	ПоступлениеВКассуРасшифровкаПлатежа.МесяцНачисления,
		|	ПоступлениеВКассуРасшифровкаПлатежа.Сумма,
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка.ВидОперации
		|ПОМЕСТИТЬ ВременнаяТаблицаРасшифровкаПлатежа
		|ИЗ
		|	Документ.ЧекККМВозврат.РасшифровкаПлатежа КАК ПоступлениеВКассуРасшифровкаПлатежа
		|ГДЕ
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеВКассу.Организация,
		|	ПоступлениеВКассу.ВидОперации,
		|	ПоступлениеВКассу.КассаККМ,
		|	ПоступлениеВКассу.ЛицевойСчет,
		|	ПоступлениеВКассу.СуммаДокумента,
		|	ПоступлениеВКассу.Дата КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ЧекККМВозврат КАК ПоступлениеВКассу
		|ГДЕ
		|	ПоступлениеВКассу.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.Организация,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.КассаККМ,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.ЭквайринговыйТерминал,
		|	ЧекККМОплатаПлатежнымиКартами.ВидПлатежнойКарты,
		|	ЧекККМОплатаПлатежнымиКартами.НомерПлатежнойКарты,
		|	ЧекККМОплатаПлатежнымиКартами.Сумма,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.Валюта,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредствПоЭквайрингу.СписаниеПоПлатежнойКарте) КАК ТипДенежныхСредств,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.Дата КАК Период,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.Дата КАК ДатаПлатежа,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.ЛицевойСчет
		|ПОМЕСТИТЬ ВременнаяТаблицаОплатаПлатежнымиКартами
		|ИЗ
		|	Документ.ЧекККМВозврат.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
		|ГДЕ
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЧекККМВозврат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаЧекККМВозврат, СтруктураДополнительныеСвойства);
	СформироватьТаблицуДенежныеСредстваВКассахККМ(ДокументСсылкаЧекККМВозврат, СтруктураДополнительныеСвойства);	
	СформироватьТаблицуРасчетыПоЭквайрингу(ДокументСсылкаЧекККМВозврат, СтруктураДополнительныеСвойства);	
	
КонецПроцедуры
